grevaillot/svd_tools/headers/ATSAMR21G18A/port.h
/** @defgroup port_dir0 DIR0 Data Direction
@{*/


#define PORT_DIR0_DIR_SHIFT		0
#define PORT_DIR0_DIR_MASK		0xffffffff
/** @defgroup port_dir0_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirclr0 DIRCLR0 Data Direction Clear
@{*/


#define PORT_DIRCLR0_DIRCLR_SHIFT		0
#define PORT_DIRCLR0_DIRCLR_MASK		0xffffffff
/** @defgroup port_dirclr0_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirset0 DIRSET0 Data Direction Set
@{*/


#define PORT_DIRSET0_DIRSET_SHIFT		0
#define PORT_DIRSET0_DIRSET_MASK		0xffffffff
/** @defgroup port_dirset0_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirtgl0 DIRTGL0 Data Direction Toggle
@{*/


#define PORT_DIRTGL0_DIRTGL_SHIFT		0
#define PORT_DIRTGL0_DIRTGL_MASK		0xffffffff
/** @defgroup port_dirtgl0_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_out0 OUT0 Data Output Value
@{*/


#define PORT_OUT0_OUT_SHIFT		0
#define PORT_OUT0_OUT_MASK		0xffffffff
/** @defgroup port_out0_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outclr0 OUTCLR0 Data Output Value Clear
@{*/


#define PORT_OUTCLR0_OUTCLR_SHIFT		0
#define PORT_OUTCLR0_OUTCLR_MASK		0xffffffff
/** @defgroup port_outclr0_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outset0 OUTSET0 Data Output Value Set
@{*/


#define PORT_OUTSET0_OUTSET_SHIFT		0
#define PORT_OUTSET0_OUTSET_MASK		0xffffffff
/** @defgroup port_outset0_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outtgl0 OUTTGL0 Data Output Value Toggle
@{*/


#define PORT_OUTTGL0_OUTTGL_SHIFT		0
#define PORT_OUTTGL0_OUTTGL_MASK		0xffffffff
/** @defgroup port_outtgl0_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_in0 IN0 Data Input Value
@{*/


#define PORT_IN0_IN_SHIFT		0
#define PORT_IN0_IN_MASK		0xffffffff
/** @defgroup port_in0_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_ctrl0 CTRL0 Control
@{*/


#define PORT_CTRL0_SAMPLING_SHIFT		0
#define PORT_CTRL0_SAMPLING_MASK		0xffffffff
/** @defgroup port_ctrl0_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_wrconfig0 WRCONFIG0 Write Configuration
@{*/

/** PORT_WRCONFIG0_HWSEL Half-Word Select **/
#define PORT_WRCONFIG0_HWSEL		(1 << 31)
/** PORT_WRCONFIG0_WRPINCFG Write PINCFG **/
#define PORT_WRCONFIG0_WRPINCFG		(1 << 30)
/** PORT_WRCONFIG0_WRPMUX Write PMUX **/
#define PORT_WRCONFIG0_WRPMUX		(1 << 28)

#define PORT_WRCONFIG0_PMUX_SHIFT		24
#define PORT_WRCONFIG0_PMUX_MASK		0x0f
/** @defgroup port_wrconfig0_pmux PMUX Peripheral Multiplexing
@{*/
/**@}*/

/** PORT_WRCONFIG0_DRVSTR Output Driver Strength Selection **/
#define PORT_WRCONFIG0_DRVSTR		(1 << 22)
/** PORT_WRCONFIG0_PULLEN Pull Enable **/
#define PORT_WRCONFIG0_PULLEN		(1 << 18)
/** PORT_WRCONFIG0_INEN Input Enable **/
#define PORT_WRCONFIG0_INEN		(1 << 17)
/** PORT_WRCONFIG0_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_WRCONFIG0_PMUXEN		(1 << 16)

#define PORT_WRCONFIG0_PINMASK_SHIFT		0
#define PORT_WRCONFIG0_PINMASK_MASK		0xffff
/** @defgroup port_wrconfig0_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_0 PMUX00 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_0_PMUXO_SHIFT		4
#define PORT_PMUX0_0_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_0_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_0_PMUXE_SHIFT		0
#define PORT_PMUX0_0_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_0_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_1 PMUX01 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_1_PMUXO_SHIFT		4
#define PORT_PMUX0_1_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_1_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_1_PMUXE_SHIFT		0
#define PORT_PMUX0_1_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_1_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_2 PMUX02 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_2_PMUXO_SHIFT		4
#define PORT_PMUX0_2_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_2_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_2_PMUXE_SHIFT		0
#define PORT_PMUX0_2_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_2_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_3 PMUX03 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_3_PMUXO_SHIFT		4
#define PORT_PMUX0_3_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_3_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_3_PMUXE_SHIFT		0
#define PORT_PMUX0_3_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_3_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_4 PMUX04 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_4_PMUXO_SHIFT		4
#define PORT_PMUX0_4_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_4_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_4_PMUXE_SHIFT		0
#define PORT_PMUX0_4_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_4_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_5 PMUX05 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_5_PMUXO_SHIFT		4
#define PORT_PMUX0_5_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_5_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_5_PMUXE_SHIFT		0
#define PORT_PMUX0_5_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_5_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_6 PMUX06 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_6_PMUXO_SHIFT		4
#define PORT_PMUX0_6_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_6_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_6_PMUXE_SHIFT		0
#define PORT_PMUX0_6_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_6_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_7 PMUX07 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_7_PMUXO_SHIFT		4
#define PORT_PMUX0_7_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_7_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_7_PMUXE_SHIFT		0
#define PORT_PMUX0_7_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_7_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_8 PMUX08 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_8_PMUXO_SHIFT		4
#define PORT_PMUX0_8_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_8_pmuxo PMUXO Peripheral Multiplexing Odd
@{*/
/**@}*/


#define PORT_PMUX0_8_PMUXE_SHIFT		0
#define PORT_PMUX0_8_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_8_pmuxe PMUXE Peripheral Multiplexing Even
@{*/
/**@}*/


/**@}*/

