grevaillot/svd_tools/headers/ATSAMR21G18A/port.h
/** PORT_PINCFG0_7_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_7_DRVSTR		(1 << 6)
/** PORT_PINCFG0_7_PULLEN Pull Enable **/
#define PORT_PINCFG0_7_PULLEN		(1 << 2)
/** PORT_PINCFG0_7_INEN Input Enable **/
#define PORT_PINCFG0_7_INEN		(1 << 1)
/** PORT_PINCFG0_7_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_7_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_8 PINCFG08 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_8_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_8_DRVSTR		(1 << 6)
/** PORT_PINCFG0_8_PULLEN Pull Enable **/
#define PORT_PINCFG0_8_PULLEN		(1 << 2)
/** PORT_PINCFG0_8_INEN Input Enable **/
#define PORT_PINCFG0_8_INEN		(1 << 1)
/** PORT_PINCFG0_8_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_8_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_9 PINCFG09 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_9_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_9_DRVSTR		(1 << 6)
/** PORT_PINCFG0_9_PULLEN Pull Enable **/
#define PORT_PINCFG0_9_PULLEN		(1 << 2)
/** PORT_PINCFG0_9_INEN Input Enable **/
#define PORT_PINCFG0_9_INEN		(1 << 1)
/** PORT_PINCFG0_9_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_9_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_10 PINCFG010 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_10_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_10_DRVSTR		(1 << 6)
/** PORT_PINCFG0_10_PULLEN Pull Enable **/
#define PORT_PINCFG0_10_PULLEN		(1 << 2)
/** PORT_PINCFG0_10_INEN Input Enable **/
#define PORT_PINCFG0_10_INEN		(1 << 1)
/** PORT_PINCFG0_10_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_10_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_11 PINCFG011 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_11_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_11_DRVSTR		(1 << 6)
/** PORT_PINCFG0_11_PULLEN Pull Enable **/
#define PORT_PINCFG0_11_PULLEN		(1 << 2)
/** PORT_PINCFG0_11_INEN Input Enable **/
#define PORT_PINCFG0_11_INEN		(1 << 1)
/** PORT_PINCFG0_11_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_11_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_12 PINCFG012 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_12_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_12_DRVSTR		(1 << 6)
/** PORT_PINCFG0_12_PULLEN Pull Enable **/
#define PORT_PINCFG0_12_PULLEN		(1 << 2)
/** PORT_PINCFG0_12_INEN Input Enable **/
#define PORT_PINCFG0_12_INEN		(1 << 1)
/** PORT_PINCFG0_12_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_12_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_13 PINCFG013 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_13_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_13_DRVSTR		(1 << 6)
/** PORT_PINCFG0_13_PULLEN Pull Enable **/
#define PORT_PINCFG0_13_PULLEN		(1 << 2)
/** PORT_PINCFG0_13_INEN Input Enable **/
#define PORT_PINCFG0_13_INEN		(1 << 1)
/** PORT_PINCFG0_13_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_13_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_14 PINCFG014 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_14_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_14_DRVSTR		(1 << 6)
/** PORT_PINCFG0_14_PULLEN Pull Enable **/
#define PORT_PINCFG0_14_PULLEN		(1 << 2)
/** PORT_PINCFG0_14_INEN Input Enable **/
#define PORT_PINCFG0_14_INEN		(1 << 1)
/** PORT_PINCFG0_14_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_14_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_15 PINCFG015 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_15_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_15_DRVSTR		(1 << 6)
/** PORT_PINCFG0_15_PULLEN Pull Enable **/
#define PORT_PINCFG0_15_PULLEN		(1 << 2)
/** PORT_PINCFG0_15_INEN Input Enable **/
#define PORT_PINCFG0_15_INEN		(1 << 1)
/** PORT_PINCFG0_15_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_15_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_16 PINCFG016 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_16_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_16_DRVSTR		(1 << 6)
/** PORT_PINCFG0_16_PULLEN Pull Enable **/
#define PORT_PINCFG0_16_PULLEN		(1 << 2)
/** PORT_PINCFG0_16_INEN Input Enable **/
#define PORT_PINCFG0_16_INEN		(1 << 1)
/** PORT_PINCFG0_16_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_16_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_17 PINCFG017 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_17_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_17_DRVSTR		(1 << 6)
/** PORT_PINCFG0_17_PULLEN Pull Enable **/
#define PORT_PINCFG0_17_PULLEN		(1 << 2)
/** PORT_PINCFG0_17_INEN Input Enable **/
#define PORT_PINCFG0_17_INEN		(1 << 1)
/** PORT_PINCFG0_17_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_17_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_18 PINCFG018 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_18_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_18_DRVSTR		(1 << 6)
/** PORT_PINCFG0_18_PULLEN Pull Enable **/
#define PORT_PINCFG0_18_PULLEN		(1 << 2)
/** PORT_PINCFG0_18_INEN Input Enable **/
#define PORT_PINCFG0_18_INEN		(1 << 1)
/** PORT_PINCFG0_18_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_18_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_19 PINCFG019 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_19_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_19_DRVSTR		(1 << 6)
/** PORT_PINCFG0_19_PULLEN Pull Enable **/
#define PORT_PINCFG0_19_PULLEN		(1 << 2)
/** PORT_PINCFG0_19_INEN Input Enable **/
#define PORT_PINCFG0_19_INEN		(1 << 1)
/** PORT_PINCFG0_19_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_19_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_20 PINCFG020 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_20_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_20_DRVSTR		(1 << 6)
/** PORT_PINCFG0_20_PULLEN Pull Enable **/
#define PORT_PINCFG0_20_PULLEN		(1 << 2)
/** PORT_PINCFG0_20_INEN Input Enable **/
#define PORT_PINCFG0_20_INEN		(1 << 1)
/** PORT_PINCFG0_20_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_PINCFG0_20_PMUXEN		(1 << 0)

/**@}*/

