grevaillot/svd_tools/headers/ATSAMR21G18A/port.h
/** @defgroup port_dirclr2 DIRCLR2 Data Direction Clear
@{*/


#define PORT_DIRCLR2_DIRCLR_SHIFT		0
#define PORT_DIRCLR2_DIRCLR_MASK		0xffffffff
/** @defgroup port_dirclr2_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirset2 DIRSET2 Data Direction Set
@{*/


#define PORT_DIRSET2_DIRSET_SHIFT		0
#define PORT_DIRSET2_DIRSET_MASK		0xffffffff
/** @defgroup port_dirset2_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirtgl2 DIRTGL2 Data Direction Toggle
@{*/


#define PORT_DIRTGL2_DIRTGL_SHIFT		0
#define PORT_DIRTGL2_DIRTGL_MASK		0xffffffff
/** @defgroup port_dirtgl2_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_out2 OUT2 Data Output Value
@{*/


#define PORT_OUT2_OUT_SHIFT		0
#define PORT_OUT2_OUT_MASK		0xffffffff
/** @defgroup port_out2_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outclr2 OUTCLR2 Data Output Value Clear
@{*/


#define PORT_OUTCLR2_OUTCLR_SHIFT		0
#define PORT_OUTCLR2_OUTCLR_MASK		0xffffffff
/** @defgroup port_outclr2_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outset2 OUTSET2 Data Output Value Set
@{*/


#define PORT_OUTSET2_OUTSET_SHIFT		0
#define PORT_OUTSET2_OUTSET_MASK		0xffffffff
/** @defgroup port_outset2_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outtgl2 OUTTGL2 Data Output Value Toggle
@{*/


#define PORT_OUTTGL2_OUTTGL_SHIFT		0
#define PORT_OUTTGL2_OUTTGL_MASK		0xffffffff
/** @defgroup port_outtgl2_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_in2 IN2 Data Input Value
@{*/


#define PORT_IN2_IN_SHIFT		0
#define PORT_IN2_IN_MASK		0xffffffff
/** @defgroup port_in2_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_ctrl2 CTRL2 Control
@{*/


#define PORT_CTRL2_SAMPLING_SHIFT		0
#define PORT_CTRL2_SAMPLING_MASK		0xffffffff
/** @defgroup port_ctrl2_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_wrconfig2 WRCONFIG2 Write Configuration
@{*/

/** PORT_WRCONFIG2_HWSEL Half-Word Select **/
#define PORT_WRCONFIG2_HWSEL		(1 << 31)
/** PORT_WRCONFIG2_WRPINCFG Write PINCFG **/
#define PORT_WRCONFIG2_WRPINCFG		(1 << 30)
/** PORT_WRCONFIG2_WRPMUX Write PMUX **/
#define PORT_WRCONFIG2_WRPMUX		(1 << 28)

#define PORT_WRCONFIG2_PMUX_SHIFT		24
#define PORT_WRCONFIG2_PMUX_MASK		0x0f
/** @defgroup port_wrconfig2_pmux PMUX Peripheral Multiplexing
@{*/
/**@}*/

/** PORT_WRCONFIG2_DRVSTR Output Driver Strength Selection **/
#define PORT_WRCONFIG2_DRVSTR		(1 << 22)
/** PORT_WRCONFIG2_PULLEN Pull Enable **/
#define PORT_WRCONFIG2_PULLEN		(1 << 18)
/** PORT_WRCONFIG2_INEN Input Enable **/
#define PORT_WRCONFIG2_INEN		(1 << 17)
/** PORT_WRCONFIG2_PMUXEN Peripheral Multiplexer Enable **/
#define PORT_WRCONFIG2_PMUXEN		(1 << 16)

#define PORT_WRCONFIG2_PINMASK_SHIFT		0
#define PORT_WRCONFIG2_PINMASK_MASK		0xffff
/** @defgroup port_wrconfig2_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux2_0 PMUX20 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_1 PMUX21 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_2 PMUX22 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_3 PMUX23 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_4 PMUX24 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_5 PMUX25 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_6 PMUX26 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_7 PMUX27 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_8 PMUX28 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_9 PMUX29 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_10 PMUX210 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_11 PMUX211 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_12 PMUX212 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_13 PMUX213 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_14 PMUX214 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pmux2_15 PMUX215 Peripheral Multiplexing n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_0 PINCFG20 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_1 PINCFG21 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_2 PINCFG22 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_3 PINCFG23 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_4 PINCFG24 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_5 PINCFG25 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_6 PINCFG26 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_7 PINCFG27 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_8 PINCFG28 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_9 PINCFG29 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_10 PINCFG210 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_11 PINCFG211 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_12 PINCFG212 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_13 PINCFG213 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_14 PINCFG214 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_15 PINCFG215 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_16 PINCFG216 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_17 PINCFG217 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_18 PINCFG218 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_19 PINCFG219 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_20 PINCFG220 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_21 PINCFG221 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_22 PINCFG222 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_23 PINCFG223 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_24 PINCFG224 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_25 PINCFG225 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_26 PINCFG226 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_27 PINCFG227 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_28 PINCFG228 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_29 PINCFG229 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_30 PINCFG230 Pin Configuration n - Group 2
@{*/


/**@}*/

/** @defgroup port_pincfg2_31 PINCFG231 Pin Configuration n - Group 2
@{*/


/**@}*/
